blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h

// SPDX-License-Identifier: GPL-2.0+ OR BSD-3-Clause
/******************************************************************************
 * Copyright (c) 2020, STMicroelectronics - All Rights Reserved

 This file is part of VL53L4CX and is dual licensed,
 either GPL-2.0+
 or 'BSD 3-clause "New" or "Revised" License' , at your option.
 ******************************************************************************
 */


#ifndef _VL53L4CX_REGISTER_MAP_H_
#define _VL53L4CX_REGISTER_MAP_H_

#define VL53L4CX_SOFT_RESET 0x0000

#define VL53L4CX_I2C_SLAVE__DEVICE_ADDRESS 0x0001

#define VL53L4CX_ANA_CONFIG__VHV_REF_SEL_VDDPIX 0x0002

#define VL53L4CX_ANA_CONFIG__VHV_REF_SEL_VQUENCH 0x0003

#define VL53L4CX_ANA_CONFIG__REG_AVDD1V2_SEL 0x0004

#define VL53L4CX_ANA_CONFIG__FAST_OSC__TRIM 0x0005

#define VL53L4CX_OSC_MEASURED__FAST_OSC__FREQUENCY 0x0006

#define VL53L4CX_OSC_MEASURED__FAST_OSC__FREQUENCY_HI 0x0006

#define VL53L4CX_OSC_MEASURED__FAST_OSC__FREQUENCY_LO 0x0007

#define VL53L4CX_VHV_CONFIG__TIMEOUT_MACROP_LOOP_BOUND 0x0008

#define VL53L4CX_VHV_CONFIG__COUNT_THRESH 0x0009

#define VL53L4CX_VHV_CONFIG__OFFSET 0x000A

#define VL53L4CX_VHV_CONFIG__INIT 0x000B

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_REF_0 0x000D

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_REF_1 0x000E

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_REF_2 0x000F

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_REF_3 0x0010

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_REF_4 0x0011

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_REF_5 0x0012

#define VL53L4CX_GLOBAL_CONFIG__REF_EN_START_SELECT 0x0013

#define VL53L4CX_REF_SPAD_MAN__NUM_REQUESTED_REF_SPADS 0x0014

#define VL53L4CX_REF_SPAD_MAN__REF_LOCATION 0x0015

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS 0x0016

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_HI 0x0016

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_LO 0x0017

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS 0x0018

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_HI 0x0018

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_LO 0x0019

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS 0x001A

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_HI 0x001A

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_LO 0x001B

#define VL53L4CX_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS 0x001C

#define VL53L4CX_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS_HI 0x001C

#define VL53L4CX_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS_LO 0x001D

#define VL53L4CX_ALGO__PART_TO_PART_RANGE_OFFSET_MM 0x001E

#define VL53L4CX_ALGO__PART_TO_PART_RANGE_OFFSET_MM_HI 0x001E

#define VL53L4CX_ALGO__PART_TO_PART_RANGE_OFFSET_MM_LO 0x001F

#define VL53L4CX_MM_CONFIG__INNER_OFFSET_MM 0x0020

#define VL53L4CX_MM_CONFIG__INNER_OFFSET_MM_HI 0x0020

#define VL53L4CX_MM_CONFIG__INNER_OFFSET_MM_LO 0x0021

#define VL53L4CX_MM_CONFIG__OUTER_OFFSET_MM 0x0022

#define VL53L4CX_MM_CONFIG__OUTER_OFFSET_MM_HI 0x0022

#define VL53L4CX_MM_CONFIG__OUTER_OFFSET_MM_LO 0x0023

#define VL53L4CX_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS 0x0024

#define VL53L4CX_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS_HI 0x0024

#define VL53L4CX_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS_LO 0x0025

#define VL53L4CX_DEBUG__CTRL 0x0026

#define VL53L4CX_TEST_MODE__CTRL 0x0027

#define VL53L4CX_CLK_GATING__CTRL 0x0028

#define VL53L4CX_NVM_BIST__CTRL 0x0029

#define VL53L4CX_NVM_BIST__NUM_NVM_WORDS 0x002A

#define VL53L4CX_NVM_BIST__START_ADDRESS 0x002B

#define VL53L4CX_HOST_IF__STATUS 0x002C

#define VL53L4CX_PAD_I2C_HV__CONFIG 0x002D

#define VL53L4CX_PAD_I2C_HV__EXTSUP_CONFIG 0x002E

#define VL53L4CX_GPIO_HV_PAD__CTRL 0x002F

#define VL53L4CX_GPIO_HV_MUX__CTRL 0x0030

#define VL53L4CX_GPIO__TIO_HV_STATUS 0x0031

#define VL53L4CX_GPIO__FIO_HV_STATUS 0x0032

#define VL53L4CX_ANA_CONFIG__SPAD_SEL_PSWIDTH 0x0033

#define VL53L4CX_ANA_CONFIG__VCSEL_PULSE_WIDTH_OFFSET 0x0034

#define VL53L4CX_ANA_CONFIG__FAST_OSC__CONFIG_CTRL 0x0035

#define VL53L4CX_SIGMA_ESTIMATOR__EFFECTIVE_PULSE_WIDTH_NS 0x0036

#define VL53L4CX_SIGMA_ESTIMATOR__EFFECTIVE_AMBIENT_WIDTH_NS 0x0037

#define VL53L4CX_SIGMA_ESTIMATOR__SIGMA_REF_MM 0x0038

#define VL53L4CX_ALGO__CROSSTALK_COMPENSATION_VALID_HEIGHT_MM 0x0039

#define VL53L4CX_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_0 0x003A

#define VL53L4CX_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_1 0x003B

#define VL53L4CX_ALGO__RANGE_IGNORE_THRESHOLD_MCPS 0x003C

#define VL53L4CX_ALGO__RANGE_IGNORE_THRESHOLD_MCPS_HI 0x003C

#define VL53L4CX_ALGO__RANGE_IGNORE_THRESHOLD_MCPS_LO 0x003D

#define VL53L4CX_ALGO__RANGE_IGNORE_VALID_HEIGHT_MM 0x003E

#define VL53L4CX_ALGO__RANGE_MIN_CLIP 0x003F

#define VL53L4CX_ALGO__CONSISTENCY_CHECK__TOLERANCE 0x0040

#define VL53L4CX_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_2 0x0041

#define VL53L4CX_SD_CONFIG__RESET_STAGES_MSB 0x0042

#define VL53L4CX_SD_CONFIG__RESET_STAGES_LSB 0x0043

#define VL53L4CX_GPH_CONFIG__STREAM_COUNT_UPDATE_VALUE 0x0044

#define VL53L4CX_GLOBAL_CONFIG__STREAM_DIVIDER 0x0045

#define VL53L4CX_SYSTEM__INTERRUPT_CONFIG_GPIO 0x0046

#define VL53L4CX_CAL_CONFIG__VCSEL_START 0x0047

#define VL53L4CX_CAL_CONFIG__REPEAT_RATE 0x0048

#define VL53L4CX_CAL_CONFIG__REPEAT_RATE_HI 0x0048

#define VL53L4CX_CAL_CONFIG__REPEAT_RATE_LO 0x0049

#define VL53L4CX_GLOBAL_CONFIG__VCSEL_WIDTH 0x004A

#define VL53L4CX_PHASECAL_CONFIG__TIMEOUT_MACROP 0x004B

#define VL53L4CX_PHASECAL_CONFIG__TARGET 0x004C

#define VL53L4CX_PHASECAL_CONFIG__OVERRIDE 0x004D

#define VL53L4CX_DSS_CONFIG__ROI_MODE_CONTROL 0x004F

#define VL53L4CX_SYSTEM__THRESH_RATE_HIGH 0x0050

#define VL53L4CX_SYSTEM__THRESH_RATE_HIGH_HI 0x0050

#define VL53L4CX_SYSTEM__THRESH_RATE_HIGH_LO 0x0051

#define VL53L4CX_SYSTEM__THRESH_RATE_LOW 0x0052

#define VL53L4CX_SYSTEM__THRESH_RATE_LOW_HI 0x0052

#define VL53L4CX_SYSTEM__THRESH_RATE_LOW_LO 0x0053

#define VL53L4CX_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT 0x0054

#define VL53L4CX_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_HI 0x0054

#define VL53L4CX_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_LO 0x0055

#define VL53L4CX_DSS_CONFIG__MANUAL_BLOCK_SELECT 0x0056

#define VL53L4CX_DSS_CONFIG__APERTURE_ATTENUATION 0x0057

#define VL53L4CX_DSS_CONFIG__MAX_SPADS_LIMIT 0x0058

#define VL53L4CX_DSS_CONFIG__MIN_SPADS_LIMIT 0x0059

#define VL53L4CX_MM_CONFIG__TIMEOUT_MACROP_A_HI 0x005A

#define VL53L4CX_MM_CONFIG__TIMEOUT_MACROP_A_LO 0x005B

#define VL53L4CX_MM_CONFIG__TIMEOUT_MACROP_B_HI 0x005C

#define VL53L4CX_MM_CONFIG__TIMEOUT_MACROP_B_LO 0x005D

#define VL53L4CX_RANGE_CONFIG__TIMEOUT_MACROP_A_HI 0x005E

#define VL53L4CX_RANGE_CONFIG__TIMEOUT_MACROP_A_LO 0x005F

#define VL53L4CX_RANGE_CONFIG__VCSEL_PERIOD_A 0x0060

#define VL53L4CX_RANGE_CONFIG__TIMEOUT_MACROP_B_HI 0x0061

