blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h
#define VL53L4CX_RANGE_CONFIG__TIMEOUT_MACROP_B_LO 0x0062

#define VL53L4CX_RANGE_CONFIG__VCSEL_PERIOD_B 0x0063

#define VL53L4CX_RANGE_CONFIG__SIGMA_THRESH 0x0064

#define VL53L4CX_RANGE_CONFIG__SIGMA_THRESH_HI 0x0064

#define VL53L4CX_RANGE_CONFIG__SIGMA_THRESH_LO 0x0065

#define VL53L4CX_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS 0x0066

#define VL53L4CX_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_HI 0x0066

#define VL53L4CX_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_LO 0x0067

#define VL53L4CX_RANGE_CONFIG__VALID_PHASE_LOW 0x0068

#define VL53L4CX_RANGE_CONFIG__VALID_PHASE_HIGH 0x0069

#define VL53L4CX_SYSTEM__INTERMEASUREMENT_PERIOD 0x006C

#define VL53L4CX_SYSTEM__INTERMEASUREMENT_PERIOD_3 0x006C

#define VL53L4CX_SYSTEM__INTERMEASUREMENT_PERIOD_2 0x006D

#define VL53L4CX_SYSTEM__INTERMEASUREMENT_PERIOD_1 0x006E

#define VL53L4CX_SYSTEM__INTERMEASUREMENT_PERIOD_0 0x006F

#define VL53L4CX_SYSTEM__FRACTIONAL_ENABLE 0x0070

#define VL53L4CX_SYSTEM__GROUPED_PARAMETER_HOLD_0 0x0071

#define VL53L4CX_SYSTEM__THRESH_HIGH 0x0072

#define VL53L4CX_SYSTEM__THRESH_HIGH_HI 0x0072

#define VL53L4CX_SYSTEM__THRESH_HIGH_LO 0x0073

#define VL53L4CX_SYSTEM__THRESH_LOW 0x0074

#define VL53L4CX_SYSTEM__THRESH_LOW_HI 0x0074

#define VL53L4CX_SYSTEM__THRESH_LOW_LO 0x0075

#define VL53L4CX_SYSTEM__ENABLE_XTALK_PER_QUADRANT 0x0076

#define VL53L4CX_SYSTEM__SEED_CONFIG 0x0077

#define VL53L4CX_SD_CONFIG__WOI_SD0 0x0078

#define VL53L4CX_SD_CONFIG__WOI_SD1 0x0079

#define VL53L4CX_SD_CONFIG__INITIAL_PHASE_SD0 0x007A

#define VL53L4CX_SD_CONFIG__INITIAL_PHASE_SD1 0x007B

#define VL53L4CX_SYSTEM__GROUPED_PARAMETER_HOLD_1 0x007C

#define VL53L4CX_SD_CONFIG__FIRST_ORDER_SELECT 0x007D

#define VL53L4CX_SD_CONFIG__QUANTIFIER 0x007E

#define VL53L4CX_ROI_CONFIG__USER_ROI_CENTRE_SPAD 0x007F

#define VL53L4CX_ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE 0x0080

#define VL53L4CX_SYSTEM__SEQUENCE_CONFIG 0x0081

#define VL53L4CX_SYSTEM__GROUPED_PARAMETER_HOLD 0x0082

#define VL53L4CX_POWER_MANAGEMENT__GO1_POWER_FORCE 0x0083

#define VL53L4CX_SYSTEM__STREAM_COUNT_CTRL 0x0084

#define VL53L4CX_FIRMWARE__ENABLE 0x0085

#define VL53L4CX_SYSTEM__INTERRUPT_CLEAR 0x0086

#define VL53L4CX_SYSTEM__MODE_START 0x0087

#define VL53L4CX_RESULT__INTERRUPT_STATUS 0x0088

#define VL53L4CX_RESULT__RANGE_STATUS 0x0089

#define VL53L4CX_RESULT__REPORT_STATUS 0x008A

#define VL53L4CX_RESULT__STREAM_COUNT 0x008B

#define VL53L4CX_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0 0x008C

#define VL53L4CX_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x008C

#define VL53L4CX_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x008D

#define VL53L4CX_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0 0x008E

#define VL53L4CX_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x008E

#define VL53L4CX_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x008F

#define VL53L4CX_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0 0x0090

#define VL53L4CX_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_HI 0x0090

#define VL53L4CX_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_LO 0x0091

#define VL53L4CX_RESULT__SIGMA_SD0 0x0092

#define VL53L4CX_RESULT__SIGMA_SD0_HI 0x0092

#define VL53L4CX_RESULT__SIGMA_SD0_LO 0x0093

#define VL53L4CX_RESULT__PHASE_SD0 0x0094

#define VL53L4CX_RESULT__PHASE_SD0_HI 0x0094

#define VL53L4CX_RESULT__PHASE_SD0_LO 0x0095

#define VL53L4CX_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0 0x0096

#define VL53L4CX_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI 0x0096

#define VL53L4CX_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO 0x0097

#define VL53L4CX_PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0 0x0098

#define VL53L4CX__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI 0x0098

#define VL53L4CX___PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO 0x0099

#define VL53L4CX_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0 0x009A

#define VL53L4CX_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x009A

#define VL53L4CX_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x009B

#define VL53L4CX_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0 0x009C

#define VL53L4CX_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x009C

#define VL53L4CX_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x009D

#define VL53L4CX_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0 0x009E

#define VL53L4CX_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x009E

#define VL53L4CX_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x009F

#define VL53L4CX_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1 0x00A0

#define VL53L4CX_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI 0x00A0

#define VL53L4CX_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO 0x00A1

#define VL53L4CX_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1 0x00A2

#define VL53L4CX_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI 0x00A2

#define VL53L4CX_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO 0x00A3

#define VL53L4CX_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1 0x00A4

#define VL53L4CX_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_HI 0x00A4

#define VL53L4CX_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_LO 0x00A5

#define VL53L4CX_RESULT__SIGMA_SD1 0x00A6

#define VL53L4CX_RESULT__SIGMA_SD1_HI 0x00A6

#define VL53L4CX_RESULT__SIGMA_SD1_LO 0x00A7

#define VL53L4CX_RESULT__PHASE_SD1 0x00A8

#define VL53L4CX_RESULT__PHASE_SD1_HI 0x00A8

#define VL53L4CX_RESULT__PHASE_SD1_LO 0x00A9

#define VL53L4CX_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1 0x00AA

#define VL53L4CX_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI 0x00AA

#define VL53L4CX_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO 0x00AB

#define VL53L4CX_RESULT__SPARE_0_SD1 0x00AC

#define VL53L4CX_RESULT__SPARE_0_SD1_HI 0x00AC

#define VL53L4CX_RESULT__SPARE_0_SD1_LO 0x00AD

#define VL53L4CX_RESULT__SPARE_1_SD1 0x00AE

#define VL53L4CX_RESULT__SPARE_1_SD1_HI 0x00AE

#define VL53L4CX_RESULT__SPARE_1_SD1_LO 0x00AF

#define VL53L4CX_RESULT__SPARE_2_SD1 0x00B0

#define VL53L4CX_RESULT__SPARE_2_SD1_HI 0x00B0

#define VL53L4CX_RESULT__SPARE_2_SD1_LO 0x00B1

#define VL53L4CX_RESULT__SPARE_3_SD1 0x00B2

#define VL53L4CX_RESULT__THRESH_INFO 0x00B3

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0 0x00B4

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3 0x00B4

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2 0x00B5

