blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h
#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1 0x00B6

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0 0x00B7

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0 0x00B8

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3 0x00B8

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2 0x00B9

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1 0x00BA

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0 0x00BB

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0 0x00BC

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3 0x00BC

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2 0x00BD

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1 0x00BE

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0 0x00BF

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0 0x00C0

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3 0x00C0

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2 0x00C1

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1 0x00C2

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0 0x00C3

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1 0x00C4

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3 0x00C4

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2 0x00C5

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1 0x00C6

#define VL53L4CX_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0 0x00C7

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1 0x00C8

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3 0x00C8

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2 0x00C9

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1 0x00CA

#define VL53L4CX_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0 0x00CB

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1 0x00CC

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3 0x00CC

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2 0x00CD

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1 0x00CE

#define VL53L4CX_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0 0x00CF

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1 0x00D0

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3 0x00D0

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2 0x00D1

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1 0x00D2

#define VL53L4CX_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0 0x00D3

#define VL53L4CX_RESULT_CORE__SPARE_0 0x00D4

#define VL53L4CX_PHASECAL_RESULT__REFERENCE_PHASE 0x00D6

#define VL53L4CX_PHASECAL_RESULT__REFERENCE_PHASE_HI 0x00D6

#define VL53L4CX_PHASECAL_RESULT__REFERENCE_PHASE_LO 0x00D7

#define VL53L4CX_PHASECAL_RESULT__VCSEL_START 0x00D8

#define VL53L4CX_REF_SPAD_CHAR_RESULT__NUM_ACTUAL_REF_SPADS 0x00D9

#define VL53L4CX_REF_SPAD_CHAR_RESULT__REF_LOCATION 0x00DA

#define VL53L4CX_VHV_RESULT__COLDBOOT_STATUS 0x00DB

#define VL53L4CX_VHV_RESULT__SEARCH_RESULT 0x00DC

#define VL53L4CX_VHV_RESULT__LATEST_SETTING 0x00DD

#define VL53L4CX_RESULT__OSC_CALIBRATE_VAL 0x00DE

#define VL53L4CX_RESULT__OSC_CALIBRATE_VAL_HI 0x00DE

#define VL53L4CX_RESULT__OSC_CALIBRATE_VAL_LO 0x00DF

#define VL53L4CX_ANA_CONFIG__POWERDOWN_GO1 0x00E0

#define VL53L4CX_ANA_CONFIG__REF_BG_CTRL 0x00E1

#define VL53L4CX_ANA_CONFIG__REGDVDD1V2_CTRL 0x00E2

#define VL53L4CX_ANA_CONFIG__OSC_SLOW_CTRL 0x00E3

#define VL53L4CX_TEST_MODE__STATUS 0x00E4

#define VL53L4CX_FIRMWARE__SYSTEM_STATUS 0x00E5

#define VL53L4CX_FIRMWARE__MODE_STATUS 0x00E6

#define VL53L4CX_FIRMWARE__SECONDARY_MODE_STATUS 0x00E7

#define VL53L4CX_FIRMWARE__CAL_REPEAT_RATE_COUNTER 0x00E8

#define VL53L4CX_FIRMWARE__CAL_REPEAT_RATE_COUNTER_HI 0x00E8

#define VL53L4CX_FIRMWARE__CAL_REPEAT_RATE_COUNTER_LO 0x00E9

#define VL53L4CX_FIRMWARE__HISTOGRAM_BIN 0x00EA

#define VL53L4CX_GPH__SYSTEM__THRESH_HIGH 0x00EC

#define VL53L4CX_GPH__SYSTEM__THRESH_HIGH_HI 0x00EC

#define VL53L4CX_GPH__SYSTEM__THRESH_HIGH_LO 0x00ED

#define VL53L4CX_GPH__SYSTEM__THRESH_LOW 0x00EE

#define VL53L4CX_GPH__SYSTEM__THRESH_LOW_HI 0x00EE

#define VL53L4CX_GPH__SYSTEM__THRESH_LOW_LO 0x00EF

#define VL53L4CX_GPH__SYSTEM__ENABLE_XTALK_PER_QUADRANT 0x00F0

#define VL53L4CX_GPH__SPARE_0 0x00F1

#define VL53L4CX_GPH__SD_CONFIG__WOI_SD0 0x00F2

#define VL53L4CX_GPH__SD_CONFIG__WOI_SD1 0x00F3

#define VL53L4CX_GPH__SD_CONFIG__INITIAL_PHASE_SD0 0x00F4

#define VL53L4CX_GPH__SD_CONFIG__INITIAL_PHASE_SD1 0x00F5

#define VL53L4CX_GPH__SD_CONFIG__FIRST_ORDER_SELECT 0x00F6

#define VL53L4CX_GPH__SD_CONFIG__QUANTIFIER 0x00F7

#define VL53L4CX_GPH__ROI_CONFIG__USER_ROI_CENTRE_SPAD 0x00F8

#define VL53L4CX_GPH__ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE 0x00F9

#define VL53L4CX_GPH__SYSTEM__SEQUENCE_CONFIG 0x00FA

#define VL53L4CX_GPH__GPH_ID 0x00FB

#define VL53L4CX_SYSTEM__INTERRUPT_SET 0x00FC

#define VL53L4CX_INTERRUPT_MANAGER__ENABLES 0x00FD

#define VL53L4CX_INTERRUPT_MANAGER__CLEAR 0x00FE

#define VL53L4CX_INTERRUPT_MANAGER__STATUS 0x00FF

#define VL53L4CX_MCU_TO_HOST_BANK__WR_ACCESS_EN 0x0100

#define VL53L4CX_POWER_MANAGEMENT__GO1_RESET_STATUS 0x0101

#define VL53L4CX_PAD_STARTUP_MODE__VALUE_RO 0x0102

#define VL53L4CX_PAD_STARTUP_MODE__VALUE_CTRL 0x0103

#define VL53L4CX_PLL_PERIOD_US 0x0104

#define VL53L4CX_PLL_PERIOD_US_3 0x0104

#define VL53L4CX_PLL_PERIOD_US_2 0x0105

#define VL53L4CX_PLL_PERIOD_US_1 0x0106

#define VL53L4CX_PLL_PERIOD_US_0 0x0107

#define VL53L4CX_INTERRUPT_SCHEDULER__DATA_OUT 0x0108

#define VL53L4CX_INTERRUPT_SCHEDULER__DATA_OUT_3 0x0108

#define VL53L4CX_INTERRUPT_SCHEDULER__DATA_OUT_2 0x0109

#define VL53L4CX_INTERRUPT_SCHEDULER__DATA_OUT_1 0x010A

#define VL53L4CX_INTERRUPT_SCHEDULER__DATA_OUT_0 0x010B

#define VL53L4CX_NVM_BIST__COMPLETE 0x010C

#define VL53L4CX_NVM_BIST__STATUS 0x010D

#define VL53L4CX_IDENTIFICATION__MODEL_ID 0x010F

#define VL53L4CX_IDENTIFICATION__MODULE_TYPE 0x0110

#define VL53L4CX_IDENTIFICATION__REVISION_ID 0x0111

#define VL53L4CX_IDENTIFICATION__MODULE_ID 0x0112

#define VL53L4CX_IDENTIFICATION__MODULE_ID_HI 0x0112

#define VL53L4CX_IDENTIFICATION__MODULE_ID_LO 0x0113

#define VL53L4CX_ANA_CONFIG__FAST_OSC__TRIM_MAX 0x0114

#define VL53L4CX_ANA_CONFIG__FAST_OSC__FREQ_SET 0x0115

#define VL53L4CX_ANA_CONFIG__VCSEL_TRIM 0x0116

#define VL53L4CX_ANA_CONFIG__VCSEL_SELION 0x0117

#define VL53L4CX_ANA_CONFIG__VCSEL_SELION_MAX 0x0118

#define VL53L4CX_PROTECTED_LASER_SAFETY__LOCK_BIT 0x0119

#define VL53L4CX_LASER_SAFETY__KEY 0x011A

#define VL53L4CX_LASER_SAFETY__KEY_RO 0x011B

