blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h
#define VL53L4CX_LASER_SAFETY__CLIP 0x011C

#define VL53L4CX_LASER_SAFETY__MULT 0x011D

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_0 0x011E

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_1 0x011F

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_2 0x0120

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_3 0x0121

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_4 0x0122

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_5 0x0123

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_6 0x0124

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_7 0x0125

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_8 0x0126

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_9 0x0127

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_10 0x0128

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_11 0x0129

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_12 0x012A

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_13 0x012B

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_14 0x012C

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_15 0x012D

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_16 0x012E

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_17 0x012F

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_18 0x0130

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_19 0x0131

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_20 0x0132

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_21 0x0133

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_22 0x0134

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_23 0x0135

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_24 0x0136

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_25 0x0137

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_26 0x0138

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_27 0x0139

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_28 0x013A

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_29 0x013B

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_30 0x013C

#define VL53L4CX_GLOBAL_CONFIG__SPAD_ENABLES_RTN_31 0x013D

#define VL53L4CX_ROI_CONFIG__MODE_ROI_CENTRE_SPAD 0x013E

#define VL53L4CX_ROI_CONFIG__MODE_ROI_XY_SIZE 0x013F

#define VL53L4CX_GO2_HOST_BANK_ACCESS__OVERRIDE 0x0300

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLICAND 0x0400

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLICAND_3 0x0400

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLICAND_2 0x0401

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLICAND_1 0x0402

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLICAND_0 0x0403

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLIER 0x0404

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLIER_3 0x0404

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLIER_2 0x0405

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLIER_1 0x0406

#define VL53L4CX_MCU_UTIL_MULTIPLIER__MULTIPLIER_0 0x0407

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_HI 0x0408

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_HI_3 0x0408

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_HI_2 0x0409

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_HI_1 0x040A

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_HI_0 0x040B

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_LO 0x040C

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_LO_3 0x040C

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_LO_2 0x040D

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_LO_1 0x040E

#define VL53L4CX_MCU_UTIL_MULTIPLIER__PRODUCT_LO_0 0x040F

#define VL53L4CX_MCU_UTIL_MULTIPLIER__START 0x0410

#define VL53L4CX_MCU_UTIL_MULTIPLIER__STATUS 0x0411

#define VL53L4CX_MCU_UTIL_DIVIDER__START 0x0412

#define VL53L4CX_MCU_UTIL_DIVIDER__STATUS 0x0413

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVIDEND 0x0414

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVIDEND_3 0x0414

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVIDEND_2 0x0415

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVIDEND_1 0x0416

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVIDEND_0 0x0417

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVISOR 0x0418

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVISOR_3 0x0418

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVISOR_2 0x0419

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVISOR_1 0x041A

#define VL53L4CX_MCU_UTIL_DIVIDER__DIVISOR_0 0x041B

#define VL53L4CX_MCU_UTIL_DIVIDER__QUOTIENT 0x041C

#define VL53L4CX_MCU_UTIL_DIVIDER__QUOTIENT_3 0x041C

#define VL53L4CX_MCU_UTIL_DIVIDER__QUOTIENT_2 0x041D

#define VL53L4CX_MCU_UTIL_DIVIDER__QUOTIENT_1 0x041E

#define VL53L4CX_MCU_UTIL_DIVIDER__QUOTIENT_0 0x041F

#define VL53L4CX_TIMER0__VALUE_IN 0x0420

#define VL53L4CX_TIMER0__VALUE_IN_3 0x0420

#define VL53L4CX_TIMER0__VALUE_IN_2 0x0421

#define VL53L4CX_TIMER0__VALUE_IN_1 0x0422

#define VL53L4CX_TIMER0__VALUE_IN_0 0x0423

#define VL53L4CX_TIMER1__VALUE_IN 0x0424

#define VL53L4CX_TIMER1__VALUE_IN_3 0x0424

#define VL53L4CX_TIMER1__VALUE_IN_2 0x0425

#define VL53L4CX_TIMER1__VALUE_IN_1 0x0426

#define VL53L4CX_TIMER1__VALUE_IN_0 0x0427

#define VL53L4CX_TIMER0__CTRL 0x0428

#define VL53L4CX_TIMER1__CTRL 0x0429

#define VL53L4CX_MCU_GENERAL_PURPOSE__GP_0 0x042C

#define VL53L4CX_MCU_GENERAL_PURPOSE__GP_1 0x042D

#define VL53L4CX_MCU_GENERAL_PURPOSE__GP_2 0x042E

#define VL53L4CX_MCU_GENERAL_PURPOSE__GP_3 0x042F

#define VL53L4CX_MCU_RANGE_CALC__CONFIG 0x0430

#define VL53L4CX_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE 0x0432

#define VL53L4CX_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE_HI 0x0432

#define VL53L4CX_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE_LO 0x0433

#define VL53L4CX_MCU_RANGE_CALC__SPARE_4 0x0434

#define VL53L4CX_MCU_RANGE_CALC__SPARE_4_3 0x0434

#define VL53L4CX_MCU_RANGE_CALC__SPARE_4_2 0x0435

#define VL53L4CX_MCU_RANGE_CALC__SPARE_4_1 0x0436

#define VL53L4CX_MCU_RANGE_CALC__SPARE_4_0 0x0437

#define VL53L4CX_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC 0x0438

#define VL53L4CX_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC_HI 0x0438

#define VL53L4CX_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC_LO 0x0439

#define VL53L4CX_MCU_RANGE_CALC__ALGO_VCSEL_PERIOD 0x043C

#define VL53L4CX_MCU_RANGE_CALC__SPARE_5 0x043D

#define VL53L4CX_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS 0x043E

#define VL53L4CX_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS_HI 0x043E

#define VL53L4CX_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS_LO 0x043F

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ACCUM_PHASE 0x0440

