blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h
#define VL53L4CX_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_3 0x0440

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_2 0x0441

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_1 0x0442

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_0 0x0443

#define VL53L4CX_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS 0x0444

#define VL53L4CX_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_3 0x0444

#define VL53L4CX_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_2 0x0445

#define VL53L4CX_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_1 0x0446

#define VL53L4CX_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_0 0x0447

#define VL53L4CX_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS 0x0448

#define VL53L4CX_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_3 0x0448

#define VL53L4CX_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_2 0x0449

#define VL53L4CX_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_1 0x044A

#define VL53L4CX_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_0 0x044B

#define VL53L4CX_MCU_RANGE_CALC__SPARE_6 0x044C

#define VL53L4CX_MCU_RANGE_CALC__SPARE_6_HI 0x044C

#define VL53L4CX_MCU_RANGE_CALC__SPARE_6_LO 0x044D

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD 0x044E

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD_HI 0x044E

#define VL53L4CX_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD_LO 0x044F

#define VL53L4CX_MCU_RANGE_CALC__NUM_SPADS 0x0450

#define VL53L4CX_MCU_RANGE_CALC__NUM_SPADS_HI 0x0450

#define VL53L4CX_MCU_RANGE_CALC__NUM_SPADS_LO 0x0451

#define VL53L4CX_MCU_RANGE_CALC__PHASE_OUTPUT 0x0452

#define VL53L4CX_MCU_RANGE_CALC__PHASE_OUTPUT_HI 0x0452

#define VL53L4CX_MCU_RANGE_CALC__PHASE_OUTPUT_LO 0x0453

#define VL53L4CX_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS 0x0454

#define VL53L4CX_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_3 0x0454

#define VL53L4CX_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_2 0x0455

#define VL53L4CX_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_1 0x0456

#define VL53L4CX_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_0 0x0457

#define VL53L4CX_MCU_RANGE_CALC__SPARE_7 0x0458

#define VL53L4CX_MCU_RANGE_CALC__SPARE_8 0x0459

#define VL53L4CX_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS 0x045A

#define VL53L4CX_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS_HI 0x045A

#define VL53L4CX_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS_LO 0x045B

#define VL53L4CX_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS 0x045C

#define VL53L4CX_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS_HI 0x045C

#define VL53L4CX_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS_LO 0x045D

#define VL53L4CX_MCU_RANGE_CALC__AMBIENT_RATE_MCPS 0x045E

#define VL53L4CX_MCU_RANGE_CALC__AMBIENT_RATE_MCPS_HI 0x045E

#define VL53L4CX_MCU_RANGE_CALC__AMBIENT_RATE_MCPS_LO 0x045F

#define VL53L4CX_MCU_RANGE_CALC__XTALK 0x0460

#define VL53L4CX_MCU_RANGE_CALC__XTALK_HI 0x0460

#define VL53L4CX_MCU_RANGE_CALC__XTALK_LO 0x0461

#define VL53L4CX_MCU_RANGE_CALC__CALC_STATUS 0x0462

#define VL53L4CX_MCU_RANGE_CALC__DEBUG 0x0463

#define VL53L4CX_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS 0x0464

#define VL53L4CX_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_HI 0x0464

#define VL53L4CX_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_LO 0x0465

#define VL53L4CX_MCU_RANGE_CALC__SPARE_0 0x0468

#define VL53L4CX_MCU_RANGE_CALC__SPARE_1 0x0469

#define VL53L4CX_MCU_RANGE_CALC__SPARE_2 0x046A

#define VL53L4CX_MCU_RANGE_CALC__SPARE_3 0x046B

#define VL53L4CX_PATCH__CTRL 0x0470

#define VL53L4CX_PATCH__JMP_ENABLES 0x0472

#define VL53L4CX_PATCH__JMP_ENABLES_HI 0x0472

#define VL53L4CX_PATCH__JMP_ENABLES_LO 0x0473

#define VL53L4CX_PATCH__DATA_ENABLES 0x0474

#define VL53L4CX_PATCH__DATA_ENABLES_HI 0x0474

#define VL53L4CX_PATCH__DATA_ENABLES_LO 0x0475

#define VL53L4CX_PATCH__OFFSET_0 0x0476

#define VL53L4CX_PATCH__OFFSET_0_HI 0x0476

#define VL53L4CX_PATCH__OFFSET_0_LO 0x0477

#define VL53L4CX_PATCH__OFFSET_1 0x0478

#define VL53L4CX_PATCH__OFFSET_1_HI 0x0478

#define VL53L4CX_PATCH__OFFSET_1_LO 0x0479

#define VL53L4CX_PATCH__OFFSET_2 0x047A

#define VL53L4CX_PATCH__OFFSET_2_HI 0x047A

#define VL53L4CX_PATCH__OFFSET_2_LO 0x047B

#define VL53L4CX_PATCH__OFFSET_3 0x047C

#define VL53L4CX_PATCH__OFFSET_3_HI 0x047C

#define VL53L4CX_PATCH__OFFSET_3_LO 0x047D

#define VL53L4CX_PATCH__OFFSET_4 0x047E

#define VL53L4CX_PATCH__OFFSET_4_HI 0x047E

#define VL53L4CX_PATCH__OFFSET_4_LO 0x047F

#define VL53L4CX_PATCH__OFFSET_5 0x0480

#define VL53L4CX_PATCH__OFFSET_5_HI 0x0480

#define VL53L4CX_PATCH__OFFSET_5_LO 0x0481

#define VL53L4CX_PATCH__OFFSET_6 0x0482

#define VL53L4CX_PATCH__OFFSET_6_HI 0x0482

#define VL53L4CX_PATCH__OFFSET_6_LO 0x0483

#define VL53L4CX_PATCH__OFFSET_7 0x0484

#define VL53L4CX_PATCH__OFFSET_7_HI 0x0484

#define VL53L4CX_PATCH__OFFSET_7_LO 0x0485

#define VL53L4CX_PATCH__OFFSET_8 0x0486

#define VL53L4CX_PATCH__OFFSET_8_HI 0x0486

#define VL53L4CX_PATCH__OFFSET_8_LO 0x0487

#define VL53L4CX_PATCH__OFFSET_9 0x0488

#define VL53L4CX_PATCH__OFFSET_9_HI 0x0488

#define VL53L4CX_PATCH__OFFSET_9_LO 0x0489

#define VL53L4CX_PATCH__OFFSET_10 0x048A

#define VL53L4CX_PATCH__OFFSET_10_HI 0x048A

#define VL53L4CX_PATCH__OFFSET_10_LO 0x048B

#define VL53L4CX_PATCH__OFFSET_11 0x048C

#define VL53L4CX_PATCH__OFFSET_11_HI 0x048C

#define VL53L4CX_PATCH__OFFSET_11_LO 0x048D

#define VL53L4CX_PATCH__OFFSET_12 0x048E

#define VL53L4CX_PATCH__OFFSET_12_HI 0x048E

#define VL53L4CX_PATCH__OFFSET_12_LO 0x048F

#define VL53L4CX_PATCH__OFFSET_13 0x0490

#define VL53L4CX_PATCH__OFFSET_13_HI 0x0490

#define VL53L4CX_PATCH__OFFSET_13_LO 0x0491

#define VL53L4CX_PATCH__OFFSET_14 0x0492

#define VL53L4CX_PATCH__OFFSET_14_HI 0x0492

#define VL53L4CX_PATCH__OFFSET_14_LO 0x0493

#define VL53L4CX_PATCH__OFFSET_15 0x0494

#define VL53L4CX_PATCH__OFFSET_15_HI 0x0494

#define VL53L4CX_PATCH__OFFSET_15_LO 0x0495

#define VL53L4CX_PATCH__ADDRESS_0 0x0496

#define VL53L4CX_PATCH__ADDRESS_0_HI 0x0496

#define VL53L4CX_PATCH__ADDRESS_0_LO 0x0497

#define VL53L4CX_PATCH__ADDRESS_1 0x0498

#define VL53L4CX_PATCH__ADDRESS_1_HI 0x0498

#define VL53L4CX_PATCH__ADDRESS_1_LO 0x0499

#define VL53L4CX_PATCH__ADDRESS_2 0x049A

#define VL53L4CX_PATCH__ADDRESS_2_HI 0x049A

#define VL53L4CX_PATCH__ADDRESS_2_LO 0x049B

#define VL53L4CX_PATCH__ADDRESS_3 0x049C

#define VL53L4CX_PATCH__ADDRESS_3_HI 0x049C

#define VL53L4CX_PATCH__ADDRESS_3_LO 0x049D

#define VL53L4CX_PATCH__ADDRESS_4 0x049E

#define VL53L4CX_PATCH__ADDRESS_4_HI 0x049E

