blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h
#define VL53L4CX_RANGING_CORE__TST_MUX_SEL2 0x06CA

#define VL53L4CX_RANGING_CORE__TST_MUX 0x06CB

#define VL53L4CX_RANGING_CORE__GPIO_OUT_TESTMUX 0x06CC

#define VL53L4CX_RANGING_CORE__CUSTOM_FE 0x06CD

#define VL53L4CX_RANGING_CORE__CUSTOM_FE_2 0x06CE

#define VL53L4CX_RANGING_CORE__SPAD_READOUT 0x06CF

#define VL53L4CX_RANGING_CORE__SPAD_READOUT_1 0x06D0

#define VL53L4CX_RANGING_CORE__SPAD_READOUT_2 0x06D1

#define VL53L4CX_RANGING_CORE__SPAD_PS 0x06D2

#define VL53L4CX_RANGING_CORE__LASER_SAFETY_2 0x06D4

#define VL53L4CX_RANGING_CORE__NVM_CTRL__MODE 0x0780

#define VL53L4CX_RANGING_CORE__NVM_CTRL__PDN 0x0781

#define VL53L4CX_RANGING_CORE__NVM_CTRL__PROGN 0x0782

#define VL53L4CX_RANGING_CORE__NVM_CTRL__READN 0x0783

#define VL53L4CX_RANGING_CORE__NVM_CTRL__PULSE_WIDTH_MSB 0x0784

#define VL53L4CX_RANGING_CORE__NVM_CTRL__PULSE_WIDTH_LSB 0x0785

#define VL53L4CX_RANGING_CORE__NVM_CTRL__HV_RISE_MSB 0x0786

#define VL53L4CX_RANGING_CORE__NVM_CTRL__HV_RISE_LSB 0x0787

#define VL53L4CX_RANGING_CORE__NVM_CTRL__HV_FALL_MSB 0x0788

#define VL53L4CX_RANGING_CORE__NVM_CTRL__HV_FALL_LSB 0x0789

#define VL53L4CX_RANGING_CORE__NVM_CTRL__TST 0x078A

#define VL53L4CX_RANGING_CORE__NVM_CTRL__TESTREAD 0x078B

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAIN_MMM 0x078C

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAIN_LMM 0x078D

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAIN_LLM 0x078E

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAIN_LLL 0x078F

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAOUT_MMM 0x0790

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAOUT_LMM 0x0791

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAOUT_LLM 0x0792

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAOUT_LLL 0x0793

#define VL53L4CX_RANGING_CORE__NVM_CTRL__ADDR 0x0794

#define VL53L4CX_RANGING_CORE__NVM_CTRL__DATAOUT_ECC 0x0795

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_0 0x0796

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_1 0x0797

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_2 0x0798

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_3 0x0799

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_4 0x079A

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_5 0x079B

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_6 0x079C

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_7 0x079D

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_8 0x079E

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_9 0x079F

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_10 0x07A0

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_11 0x07A1

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_12 0x07A2

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_13 0x07A3

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_14 0x07A4

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_15 0x07A5

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_16 0x07A6

#define VL53L4CX_RANGING_CORE__RET_SPAD_EN_17 0x07A7

#define VL53L4CX_RANGING_CORE__SPAD_SHIFT_EN 0x07BA

#define VL53L4CX_RANGING_CORE__SPAD_DISABLE_CTRL 0x07BB

#define VL53L4CX_RANGING_CORE__SPAD_EN_SHIFT_OUT_DEBUG 0x07BC

#define VL53L4CX_RANGING_CORE__SPI_MODE 0x07BD

#define VL53L4CX_RANGING_CORE__GPIO_DIR 0x07BE

#define VL53L4CX_RANGING_CORE__VCSEL_PERIOD 0x0880

#define VL53L4CX_RANGING_CORE__VCSEL_START 0x0881

#define VL53L4CX_RANGING_CORE__VCSEL_STOP 0x0882

#define VL53L4CX_RANGING_CORE__VCSEL_1 0x0885

#define VL53L4CX_RANGING_CORE__VCSEL_STATUS 0x088D

#define VL53L4CX_RANGING_CORE__STATUS 0x0980

#define VL53L4CX_RANGING_CORE__LASER_CONTINUITY_STATE 0x0981

#define VL53L4CX_RANGING_CORE__RANGE_1_MMM 0x0982

#define VL53L4CX_RANGING_CORE__RANGE_1_LMM 0x0983

#define VL53L4CX_RANGING_CORE__RANGE_1_LLM 0x0984

#define VL53L4CX_RANGING_CORE__RANGE_1_LLL 0x0985

#define VL53L4CX_RANGING_CORE__RANGE_REF_1_MMM 0x0986

#define VL53L4CX_RANGING_CORE__RANGE_REF_1_LMM 0x0987

#define VL53L4CX_RANGING_CORE__RANGE_REF_1_LLM 0x0988

#define VL53L4CX_RANGING_CORE__RANGE_REF_1_LLL 0x0989

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_MMM 0x098A

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LMM 0x098B

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LLM 0x098C

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LLL 0x098D

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_1_MMM 0x098E

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_1_LMM 0x098F

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_1_LLM 0x0990

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_1_LLL 0x0991

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_MMM 0x0992

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_LMM 0x0993

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_LLM 0x0994

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_LLL 0x0995

#define VL53L4CX_RANGING_CORE__TOTAL_PERIODS_ELAPSED_1_MM 0x0996

#define VL53L4CX_RANGING_CORE__TOTAL_PERIODS_ELAPSED_1_LM 0x0997

#define VL53L4CX_RANGING_CORE__TOTAL_PERIODS_ELAPSED_1_LL 0x0998

#define VL53L4CX_RANGING_CORE__AMBIENT_MISMATCH_MM 0x0999

#define VL53L4CX_RANGING_CORE__AMBIENT_MISMATCH_LM 0x099A

#define VL53L4CX_RANGING_CORE__AMBIENT_MISMATCH_LL 0x099B

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_MMM 0x099C

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_LMM 0x099D

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_LLM 0x099E

#define VL53L4CX_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_LLL 0x099F

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_MMM 0x09A0

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_LMM 0x09A1

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_LLM 0x09A2

#define VL53L4CX_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_LLL 0x09A3

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_MMM 0x09A4

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_LMM 0x09A5

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_LLM 0x09A6

#define VL53L4CX_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_LLL 0x09A7

#define VL53L4CX_RANGING_CORE__TOTAL_PERIODS_ELAPSED_REF_1_MM 0x09A8

#define VL53L4CX_RANGING_CORE__TOTAL_PERIODS_ELAPSED_REF_1_LM 0x09A9

#define VL53L4CX_RANGING_CORE__TOTAL_PERIODS_ELAPSED_REF_1_LL 0x09AA

