blues/app-accelerators/sense-hat-reference/.pio/libdeps/bw_swan_r5/STM32duino VL53L4CX/src/vl53l4cx_register_map.h
#define VL53L4CX_DSS_CALC__ROI_CTRL 0x0F54

#define VL53L4CX_DSS_CALC__SPARE_1 0x0F55

#define VL53L4CX_DSS_CALC__SPARE_2 0x0F56

#define VL53L4CX_DSS_CALC__SPARE_3 0x0F57

#define VL53L4CX_DSS_CALC__SPARE_4 0x0F58

#define VL53L4CX_DSS_CALC__SPARE_5 0x0F59

#define VL53L4CX_DSS_CALC__SPARE_6 0x0F5A

#define VL53L4CX_DSS_CALC__SPARE_7 0x0F5B

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_0 0x0F5C

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_1 0x0F5D

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_2 0x0F5E

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_3 0x0F5F

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_4 0x0F60

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_5 0x0F61

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_6 0x0F62

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_7 0x0F63

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_8 0x0F64

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_9 0x0F65

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_10 0x0F66

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_11 0x0F67

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_12 0x0F68

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_13 0x0F69

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_14 0x0F6A

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_15 0x0F6B

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_16 0x0F6C

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_17 0x0F6D

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_18 0x0F6E

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_19 0x0F6F

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_20 0x0F70

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_21 0x0F71

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_22 0x0F72

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_23 0x0F73

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_24 0x0F74

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_25 0x0F75

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_26 0x0F76

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_27 0x0F77

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_28 0x0F78

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_29 0x0F79

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_30 0x0F7A

#define VL53L4CX_DSS_CALC__USER_ROI_SPAD_EN_31 0x0F7B

#define VL53L4CX_DSS_CALC__USER_ROI_0 0x0F7C

#define VL53L4CX_DSS_CALC__USER_ROI_1 0x0F7D

#define VL53L4CX_DSS_CALC__MODE_ROI_0 0x0F7E

#define VL53L4CX_DSS_CALC__MODE_ROI_1 0x0F7F

#define VL53L4CX_SIGMA_ESTIMATOR_CALC__SPARE_0 0x0F80

#define VL53L4CX_VHV_RESULT__PEAK_SIGNAL_RATE_MCPS 0x0F82

#define VL53L4CX_VHV_RESULT__PEAK_SIGNAL_RATE_MCPS_HI 0x0F82

#define VL53L4CX_VHV_RESULT__PEAK_SIGNAL_RATE_MCPS_LO 0x0F83

#define VL53L4CX_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF 0x0F84

#define VL53L4CX_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_3 0x0F84

#define VL53L4CX_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_2 0x0F85

#define VL53L4CX_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_1 0x0F86

#define VL53L4CX_VHV_RESULT__SIGNAL_TOTAL_EVENTS_REF_0 0x0F87

#define VL53L4CX_PHASECAL_RESULT__PHASE_OUTPUT_REF 0x0F88

#define VL53L4CX_PHASECAL_RESULT__PHASE_OUTPUT_REF_HI 0x0F88

#define VL53L4CX_PHASECAL_RESULT__PHASE_OUTPUT_REF_LO 0x0F89

#define VL53L4CX_DSS_RESULT__TOTAL_RATE_PER_SPAD 0x0F8A

#define VL53L4CX_DSS_RESULT__TOTAL_RATE_PER_SPAD_HI 0x0F8A

#define VL53L4CX_DSS_RESULT__TOTAL_RATE_PER_SPAD_LO 0x0F8B

#define VL53L4CX_DSS_RESULT__ENABLED_BLOCKS 0x0F8C

#define VL53L4CX_DSS_RESULT__NUM_REQUESTED_SPADS 0x0F8E

#define VL53L4CX_DSS_RESULT__NUM_REQUESTED_SPADS_HI 0x0F8E

#define VL53L4CX_DSS_RESULT__NUM_REQUESTED_SPADS_LO 0x0F8F

#define VL53L4CX_MM_RESULT__INNER_INTERSECTION_RATE 0x0F92

#define VL53L4CX_MM_RESULT__INNER_INTERSECTION_RATE_HI 0x0F92

#define VL53L4CX_MM_RESULT__INNER_INTERSECTION_RATE_LO 0x0F93

#define VL53L4CX_MM_RESULT__OUTER_COMPLEMENT_RATE 0x0F94

#define VL53L4CX_MM_RESULT__OUTER_COMPLEMENT_RATE_HI 0x0F94

#define VL53L4CX_MM_RESULT__OUTER_COMPLEMENT_RATE_LO 0x0F95

#define VL53L4CX_MM_RESULT__TOTAL_OFFSET 0x0F96

#define VL53L4CX_MM_RESULT__TOTAL_OFFSET_HI 0x0F96

#define VL53L4CX_MM_RESULT__TOTAL_OFFSET_LO 0x0F97

#define VL53L4CX_XTALK_CALC__XTALK_FOR_ENABLED_SPADS 0x0F98

#define VL53L4CX_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_3 0x0F98

#define VL53L4CX_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_2 0x0F99

#define VL53L4CX_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_1 0x0F9A

#define VL53L4CX_XTALK_CALC__XTALK_FOR_ENABLED_SPADS_0 0x0F9B

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS 0x0F9C

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_3 0x0F9C

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_2 0x0F9D

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_1 0x0F9E

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_USER_ROI_KCPS_0 0x0F9F

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS 0x0FA0

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_3 0x0FA0

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_2 0x0FA1

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_1 0x0FA2

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_INNER_ROI_KCPS_0 0x0FA3

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS 0x0FA4

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_3 0x0FA4

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_2 0x0FA5

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_1 0x0FA6

#define VL53L4CX_XTALK_RESULT__AVG_XTALK_MM_OUTER_ROI_KCPS_0 0x0FA7

#define VL53L4CX_RANGE_RESULT__ACCUM_PHASE 0x0FA8

#define VL53L4CX_RANGE_RESULT__ACCUM_PHASE_3 0x0FA8

#define VL53L4CX_RANGE_RESULT__ACCUM_PHASE_2 0x0FA9

#define VL53L4CX_RANGE_RESULT__ACCUM_PHASE_1 0x0FAA

#define VL53L4CX_RANGE_RESULT__ACCUM_PHASE_0 0x0FAB

#define VL53L4CX_RANGE_RESULT__OFFSET_CORRECTED_RANGE 0x0FAC

#define VL53L4CX_RANGE_RESULT__OFFSET_CORRECTED_RANGE_HI 0x0FAC

#define VL53L4CX_RANGE_RESULT__OFFSET_CORRECTED_RANGE_LO 0x0FAD

#define VL53L4CX_SHADOW_PHASECAL_RESULT__VCSEL_START 0x0FAE

#define VL53L4CX_SHADOW_RESULT__INTERRUPT_STATUS 0x0FB0

#define VL53L4CX_SHADOW_RESULT__RANGE_STATUS 0x0FB1

#define VL53L4CX_SHADOW_RESULT__REPORT_STATUS 0x0FB2

#define VL53L4CX_SHADOW_RESULT__STREAM_COUNT 0x0FB3

#define VL53L4CX_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0 0x0FB4

#define VL53L4CX_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0FB4

#define VL53L4CX_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0FB5

#define VL53L4CX_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0 0x0FB6

#define VL53L4CX_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0FB6

